transonic-dlrbuffet/setups.orig/kOmegaSST/0.orig/U
/*--------------------------------*- C++ -*----------------------------------* \
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/freestreamConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    INLET
    {
      
        //type            freestreamVelocity;
        //freestreamValue uniform $Uinlet;
	 type characteristicVelocityInletOutletVelocity;
        //type characteristicFarfieldVelocity;
         U $Uinlet;
         p $pinlet;
         T $Tinlet;
         value $internalField;
    }
    OUTLET
    {
         type characteristicPressureInletOutletVelocity;
        // type characteristicFarfieldVelocity;
         U $Uoutlet;
         p $poutlet;
         T $Toutlet;
         value $internalField;
        //type zeroGradient;
 	//value           $internalField;
    }
    row_1_PER1
    {
        type            cyclic;
    }
    row_1_PER2
    {
        type            cyclic;
    }
    Blade
    {
	    type            boundaryCorrectedFixedValue;
	    value           uniform (0 0 0);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
